app/Controllers/Task.php

SELECT *
FROM `tasks`
WHERE `user_id` = '1'
---
    public function index()
    {
        if (!session()->has('logged_in')) {
            return redirect()->to('/login');
        }

        $tasks = $this->taskModel->where('user_id', session()->get('logged_in'))->findAll();

INSERT INTO `tasks` (`title`, `description`, `status`, `user_id`) VALUES ('Task 1', 'Hello', 'pending', '1')
---
    public function store()
    {
        $this->taskModel->save([
            'title'       => $this->request->getPost('title'),
            'description' => $this->request->getPost('description'),
            'status'      => 'pending',
            'user_id'     => session()->get('logged_in'),
        ]);